# Выведите первый и последний элемент списка.
kek = list(input("Введите элементы списка через пробел: ").split())
print(f'Первый: {kek[0]} Последний: {kek[-1]}')